[
  {
    "monthYearRange": "May 2025 – Present",
    "title": "Software Developer",
    "subTitle": "Konnektaro",
    "cardLink": "https://konnektaro.com/",
    "description": "Developed a mobile-first progressive web app for real-time learning, and networking sessions using React, Next.js, and TypeScript.",
    "chips": [
      "React TS",
      "Next JS",
      "Express",
      "Node JS",
      "HTML",
      "Tailwind CSS",
      "CSS",
      "CI/DC",
      "Firebase",
      "MongoDB",
      "Figma",
      "OpenAI, Whisper"
    ]
  },
  {
    "monthYearRange": "Mar 2024 - Dec 2024",
    "title": "Founding Engineer / Technical Advisor",
    "subTitle": "EduEnvire",
    "cardLink": "https://eduenvire.com/",
    "description": "Developed a check-in system that allowed students to register their attendance while giving teachers real-time insights into device usage without restricting access. This tool improved classroom management by promoting responsible device use. I led the design and development, working with the backend team to ensure seamless integration and a user-friendly interface, while creating a scalable solution for future needs.",
    "chips": [
      "React TS",
      "React Native",
      "HTML",
      "CSS",
      "CI/DC",
      "Azure AD",
      "Figma"
    ]
  },
  {
    "monthYearRange": "Jun 2020 - Dec 2023",
    "title": "Frontend Engineer",
    "subTitle": "iomoto",
    "cardLink": "https://www.iomoto.io/",
    "description": "Build, style, and ship high-quality a fleet management platform, ensuring secure access for over 5000 vehicles. From conception to beta, crafted a versatile white-label solution, facilitating diverse business needs. This project underscored my ability to navigate complex challenges, delivering robust digital solutions that cater to the intricate needs of large-scale fleet management.",
    "chips": [
      "React",
      "HTML",
      "CSS",
      "Jest",
      "Cypress",
      "CI/DC",
      "Azure AD",
      "Jira",
      "Figma"
    ]
  },
  {
    "monthYearRange": "Jan 2023 - Dec 2023",
    "title": "Mobile Developer",
    "subTitle": "iomoto",
    "cardLink": "https://www.iomoto.io/",
    "description": "Developed a B2C automotive sales app. Utilized user data to assess electric vehicle fit. Engineered virtual electric vehicle for direct comparison. Led garage feature development, ensuring user-centricity. Managed login flow for security. Contributed to main app and conducted unit testing.",
    "chips": ["Flutter", "Dart", "CI/DC", "Azure/DevOps"],
    "links": [
      { "title": "Lity", "url": "https://lity.io/" },
      {
        "title": "Apple store",
        "url": "https://apps.apple.com/ch/app/lity/id6448170700"
      }
    ]
  },
  {
    "monthYearRange": "Nov 2019 - Jan 2020",
    "title": "Frontend Engineer, Intern",
    "subTitle": "The Key Technology",
    "cardLink": "https://www.thekey.technology/en/",
    "description": "Contributed to diverse client assignments, including the development of an auction house app using React JavaScript. Gained backend expertise by creating REST endpoints in Scala, ensuring quality with endpoint-specific unit tests.",
    "chips": ["React", "Jest", "Scala"]
  }
]
